#include "delay.h"
	 
static u8  fac_us=0;             	//us延时倍乘数(计时1us需要计数次数)
static u16 fac_ms=0;             	//ms延时倍乘数(计时1ms需要计数次数)		


/************************************************************************************
* 函数名称：delay_init
* 功能描述：延迟的初始化函数
* 输入参数：-HCLK:HCLK时钟频率,单位为MHZ
* 返 回 值：无
************************************************************************************/
void delay_init(u8 HCLK)
{
	SysTick->CTRL&=~(1<<2);  		//bit2清空,选择外部时钟STCLK(HCLK/8)
	fac_us=HCLK/8;		    	    //计时1us需要计数次数(见readme详解)
	fac_ms=(u16)fac_us*1000; 		//计时1ms需要计数次数(见readme详解)
}


/************************************************************************************
* 函数名称：delay_us
* 功能描述：微秒延时函数,24位计数器,72M下最大能延时1864135us(HCLK越小nms可取更大)
* 输入参数：-nus:延时时间
* 返 回 值：无
************************************************************************************/   		    								   
void delay_us(u32 nus)
{
	u32 temp;	    	 
	SysTick->LOAD=nus*fac_us;       //时间加载	  		                    
	SysTick->VAL=0x00;              //清空计数器						
	SysTick->CTRL|=0x01;            //开始倒数 	 					  
	do
	{
		temp=SysTick->CTRL;
	} while(!(temp & 1<<16));					//等待时间到达                        
	SysTick->CTRL=0x00;             //关闭计数器						
	SysTick->VAL =0X00;             //清空计数器	 	
}


/************************************************************************************
* 函数名称：delay_nms
* 功能描述：毫秒延时函数,24位计数器,72M条件下最大能延时1864ms(HCLK越小nms可取更大)
* 输入参数：-nms:延时时间
* 返 回 值：无
*************************************************************************************/
void delay_nms(u16 nms)
{	 		  	  
	u32 temp;		   
	SysTick->LOAD=(u32)nms*fac_ms;  //时间加载(SysTick->LOAD为24bit)		 
	SysTick->VAL =0x00;             //清空计数器					   		 
	SysTick->CTRL|=0x01;            //开始倒数  							 
	do
	{
		temp=SysTick->CTRL;
	}while(!(temp & 1<<16));					//等待时间到达                         
	SysTick->CTRL=0x00;             //关闭计数器                            
	SysTick->VAL =0X00;             //清空计数器	  	
}

/************************************************************************************
* 函数名称：delay_ms
* 功能描述：毫秒延时函数,可延时1-65536ms
* 输入参数：-ms:延时时间
* 返 回 值：无
*************************************************************************************/
void delay_ms(u16 ms)
{
	u8 temp1=ms/1000;
	u16 temp2=ms%1000;
	while(temp1)
	{
		delay_nms(1000);
		temp1--;
	}
	if(temp2)
		delay_nms(temp2);
}
