#include "gu900_timer.h"
#include "gu900_uart.h"
#include <stdio.h>
#include "gu900.h"

/************************************************************************************
* 函数名称：TIME7_Init
* 功能描述：TIME7初始化以及定时1s函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIME7_Init(void)
{   
  RCC->APB1ENR |= (1<<5);	//开TIME7外设时钟
  //配置定时器
  TIM7->CR1 |= (1<<7);	//使能影子寄存器
  TIM7->CR1 |= (1<<3);	//计数溢出计数器停止
  TIM7->CR1 |= (1<<2);	//只能计数溢出发生更新中断
  TIM7->CR1 &= ~(1<<1);	//使能更新
  NVIC_SetPriority(TIM7_IRQn,NVIC_EncodePriority(7-2,2,0));//组2抢占优先级2，响应优先级0
  NVIC_EnableIRQ(TIM7_IRQn);		
	TIM7->DIER |= (1<<0);//使能更新中断
  TIM7->PSC = 7200-1; 	//配置预分频
  TIM7->ARR = 10000-1;  //配置自动重装载 
  TIM7->EGR |= (1<<0); //软件产生更新事件
}

/************************************************************************************
* 函数名称：time7_start
* 功能描述：定时器开始函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_start(void)
{
    //使能
    TIM7->CNT = 0;
    TIM7->CR1 |= (1<<0);    
}

/************************************************************************************
* 函数名称：time7_stop
* 功能描述：定时器停止函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_stop(void)
{
    TIM7->CR1 &= ~(1<<0);    
}

/************************************************************************************
* 函数名称：time7_set_timeout
* 功能描述：设置定时器时间函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_set_timeout(u16 time)
{
    TIM7->ARR = 10 * time;   //转成1ms的单位
}

/************************************************************************************
* 函数名称：time7_reset
* 功能描述：定时器复位倒计时函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_reset(void)
{
    TIM7->CNT = 0;
}

/************************************************************************************
* 函数名称：TIM7_IRQHandler
* 功能描述：定时器中断函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIM7_IRQHandler(void)
{
    TIM7->SR &= ~(1<<0);//清除标志位
    gu900_uart_buff[gu900_uart_len] = '\0'; //加结束符
    gu900_uart_len = 0;
    gu900_recv_flag = 1;  //接收完成标志 
		printf("gsm_uart_buff=%s\r\n",gu900_uart_buff);
}

