#include "modbus_timer.h"
#include "rs485.h"
#include <stdio.h>
#include "usart.h"

/************************************************************************************
* 函数名称：TIME7_Init
* 功能描述：TIME7初始化以及定时1s函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIME7_Init(u16 arr,u16 psc)
{   
  RCC->APB1ENR |= (1<<5);	//开TIME7外设时钟
  //配置定时器
	TIM7->PSC=psc; //设置预分频系数
	TIM7->ARR=arr; //设置重装载值
	TIM7->CR1 |= 1<<7;//开启影子寄存器
	TIM7->EGR |= 1<<0; //设置UG位,软件更新
	TIM7->SR =~0X01;   //清标志
	TIM7->DIER |=1<<0; //开启定时器中断  
  NVIC_SetPriority(TIM7_IRQn,NVIC_EncodePriority(7-2,1,2));//组2抢占优先级2，响应优先级0
  NVIC_EnableIRQ(TIM7_IRQn);		
}

/************************************************************************************
* 函数名称：time7_start
* 功能描述：定时器开始函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_start(void)
{
    //使能
    TIM7->CNT = 0;
    TIM7->CR1 |= (1<<0);    
}

/************************************************************************************
* 函数名称：time7_stop
* 功能描述：定时器停止函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_stop(void)
{
    TIM7->CR1 &= ~(1<<0);    
}

/************************************************************************************
* 函数名称：time7_set_timeout
* 功能描述：设置定时器时间函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_set_timeout(u16 time)
{
    TIM7->ARR = 10 * time;   //转成1ms的单位
}

/************************************************************************************
* 函数名称：time7_reset
* 功能描述：定时器复位倒计时函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time7_reset(void)
{
    TIM7->CNT = 0;
}

/************************************************************************************
* 函数名称：TIM7_IRQHandler
* 功能描述：定时器中断函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIM7_IRQHandler(void)
{
	if(TIM7->SR&0X01)				//是更新中断
	{
		rs485_recv_flag = 1;	//标记接收完成
    
		RS485_RX_CNT=0;
		TIM7->SR &= ~(1<<0);//清除中断标志位
		time7_stop();				//关闭定时器
	}
}

