#include "timer.h"
#include "usart.h"
#include "volmeter.h"
#include "gu900.h"
#include "delay.h"

u8 worktimes_flag;
u16 capture_time_count=CAPTURETIME;
/************************************************************************************
* 函数名称：TIME6_Init
* 功能描述：TIME6初始化以及定时1s函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIM6_Init(u16 psc,u16 arr)
{
	RCC->APB1ENR |= 1<<4; //开启定时器6时钟源
	TIM6->PSC=psc; //设置预分频系数
	TIM6->ARR=arr; //设置重装载值
	TIM6->CR1 |= 1<<7;//开启影子寄存器
	TIM6->EGR |= 1<<0; //设置UG位,软件更新
	TIM6->SR =~0X01;   //清标志
	TIM6->DIER |=1<<0; //开启定时器中断
	//设置NVIC
	NVIC_SetPriorityGrouping(7-2); //设置为分组2
	NVIC_SetPriority(TIM6_IRQn,NVIC_EncodePriority(7-2,2,2));//抢占优先级设置为,响应优先级为2
	NVIC_EnableIRQ(TIM6_IRQn);
	//TIM6->CR1 |= 1<<0; //使能计数
}

/************************************************************************************
* 函数名称：time7_start
* 功能描述：定时器开始函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time6_start(void)
{
    //使能
    TIM6->CNT = 0;
    TIM6->CR1 |= (1<<0);    
}

/************************************************************************************
* 函数名称：time7_stop
* 功能描述 ：定时器停止函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void time6_stop(void)
{
    TIM6->CR1 &= ~(1<<0);    
}


/************************************************************************************
* 函数名称：TIM6_IRQHandler
* 功能描述：TIME6更新中断函数
* 入口参数：无
* 出口参数：无
*************************************************************************************/
void TIM6_IRQHandler(void)
{
	if(TIM6->SR & 1<<0) //定时器6中断
	{
		TIM6->SR &= ~(1<<0); //清标志
		capture_time_count--;
		if(capture_time_count==1)		//1min采集一次
		{
			capture_time_count=CAPTURETIME;
			worktimes_flag=1;
		}
	}
}



